{
  "projects": [
    {
      "id": 5,
      "title": "Custom Dynamometer for Brushless Motor",
      "description": "Designed and tested a custom dynamometer to measure torque, speed, and efficiency of a BLDC motor using integrated ESP32 control to automatically run tests and collect data.",
      "detailedDescription": "For an experimental design course, I worked with a team to build and evaluate a dynamometer system to characterize the performance of a BL4825O brushless DC motor. The motor was mounted on a lever arm connected to a load cell, while a four-blade propeller submerged in water provided controllable resistance. Load was adjusted by changing the water level in the tank, enabling testing under a wide range of operating conditions. My contribution focused on the electronics and data acquisition system. I assembled the ESP32-based controller, which regulated motor duty cycle, read the motor’s integrated speed sensor, and processed load cell signals to calculate torque. These outputs were combined to calculate efficiency and power at different duty cycles and voltages. MATLAB was used to analyze and plot the collected data. The dynamometer revealed expected motor behavior, including decreasing speed with increasing load, rising current draw with torque, and efficiencies plateauing in the 45–60% range. This validated the system as a reliable low-cost tool for performance characterization when manufacturer data was limited.",
      "technologies": ["ESP32 Microcontroller", "Load Cell Measurement", "BLDC Motor", "Embedded C Programming", "MATLAB Data Analysis", "Experimental Design"],
      "status": "Completed",
      "images": [
        { "file": "main.jpg", "caption": "Completed BLDC motor dynamometer setup" },
        { "file": "running.jpg", "caption": "Dynomometer running with water providing load" },
        { "file": "speed-torque-plot.jpg", "caption": "Speed-torque performance curve" },
        { "file": "torque-efficiency-plot.jpg", "caption": "Motor load vs efficiency characteristics" }
      ],
      "folder": "bldc-dyno",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2024-12-5",
      "category": "Class Project",
      "challenges": ["Designing a torque measurement system using a lever arm and load cell", "Managing inconsistent water-based resistance caused by splashing and leakage", "Quickly collect many data points through autonomous testing"],
      "outcomes": ["Delivered a functional dynamometer capable of producing torque, efficiency, and power curves", "Produced a technical report and presentation with performance curves aligned to expected industry data"]
    },
    {
      "id": 2,
      "title": "Portable Wheelchair Lift",
      "description": "Collaborated with a 16-member team to design and build a portable wheelchair lift for a high school robotics shop. Led electronics design and programming, integrating actuator synchronization, safety interlocks, and waterproof controls into a reliable user-operated system.",
      "detailedDescription": "This project addressed an accessibility need for a local robotics team whose shop was only reachable via a loading dock. The solution was a portable wheelchair lift that could be rolled into place and safely operated by the user. I served as electronics lead, responsible for designing the control system, programming the actuator logic, and supervising wiring and assembly. The lift used four 12V, 20A linear actuators, each rated for 900 lb. I implemented a custom PID synchronization algorithm on an ESP32 to maintain platform levelness and avoid frame stress caused by over-constraint with an actuator at each corner. To ensure reliability, the actuators homed using limit switches on startup, calibrating the lift before operation. I coordinated with the frame and carriage sub teams to specify actuator requirements, predict current draw, and integrate safety sensors at appropriate locations.The system raised the platform 31 inches in under 30 seconds while withstanding real-world snow and rain exposure. Safety features included reed switch door interlocks, dual emergency stops, and wired control panels at the top, bottom, and inside the carriage. All wiring was routed through the frame tubing for protection, enclosed in a waterproof housing. To support long-term serviceability, we created detailed circuit layouts, technical drawings and a full maintenance manual. Load capacity was validated through live tests, confirming that the system safely lifted more than 600 lb. without structural or control failures.",
      "technologies": ["ESP32 Microcontroller", "PID Motor Control", "Circuit Design", "Arduino/C++", "Weatherproof Wiring", "Systems Integration", "FMEA Validation"],
      "status": "Completed",
      "images": [
        { "file": "door-open.jpg", "caption": "Portable Wheelchair Lift" },
        { "file": "lifted.jpg", "caption": "Lift fully extended" },
        { "file": "external-wiring.jpg", "caption": "External wiring harness" },
        { "file": "closeup-wiring.jpg", "caption": "Weatherproof control box" },
        { "file": "unconected-board.jpg", "caption": "Unconnected ciruit with 4 motor drivers and ESP32" },
        { "file": "wiring-diagram.jpg", "caption": "Overview wiring digram of the lift" }
      ],
      "folder": "wheelchair-lift",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2024-12-15",
      "category": "Class Project",
      "challenges": ["Synchronizing four actuators under uneven loads without binding or induced stress", "Routing wires within the steel frame for outdoor durability", "Coordinating across sub teams to align actuator specs with structural and carriage designs", "Delivering a fully functional, documented system on a tight course deadline"],
      "outcomes": ["Delivered a lift that safely raised 31” in under 30 seconds while supporting over 600 lb", "Fully validated performance through live load testing", "Produced detailed wiring diagrams, circuit layouts, and a maintenance manual for future use", "Demonstrated integration of electrical, mechanical, and software systems into a robust accessibility solution"]
    },
    {
      "id": 6,
      "title": "Pathfinding Robot",
      "description": "Built and programmed a robot that autonomously navigated a cluttered arena using an overhead camera for localization and an IR sensor for mapping. Implemented continuous breadth-first search on an ESP32 to update the shortest path in real time.",
      "detailedDescription": "For a mechatronics course project, I developed a small autonomous robot capable of navigating through dynamic obstacle layouts. The system used an overhead camera to track the robot's global position and orientation, while a scanning IR distance sensor on a gimbal detected obstacles in the environment. I programmed the ESP32 microcontroller to convert IR scans into a global occupancy map, maintaining a 100x100 resolution grid of the arena. A breadth-first search algorithm continuously updated the map, recalculating shortest paths as new obstacles were detected. The path-finding results were translated into steering commands through a state machine that coordinated driving, obstacle avoidance, and target approach.\nMy contributions included both programming the navigation and mapping system and helping design and assemble the robot hardware, including sensor mounts and wiring. The approach allowed the robot to adapt in real time, avoid repeated collisions, and reach targets more efficiently than many peer robots.",
      "technologies": ["ESP32 Microcontroller", "Arduino/C++", "IR Sensing", "Obstacle Mapping", "Breadth-First Search", "State Machine Control"],
      "status": "Completed",
      "images": [
        { "file": "main.jpg", "caption": "Pathfinding robot with gimbles IR distance sensor" },
        { "file": "obstical-field.jpg", "caption": "Boolean global obstacle field (2 shows target)" },
        { "file": "scalar-field.jpg", "caption": "Scalar distance to target field using BFS" },
        { "file": "vector-field.jpg", "caption": "Vector flow field used to guide robot to target" }
      ],
      "folder": "pathfinding-robot",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2024-11-10",
      "category": "Class Project",
      "challenges": ["Running a continuous BFS pathfinding algorithm within the ESP32's limited memory and processing budget", "Filtering noisy IR data to maintain a reliable obstacle map", "Balancing mapping and controls computation"],
      "outcomes": ["Delivered a fully functional autonomous robot with continuous real-time pathfinding", "Demonstrated integration of global localization, local obstacle detection, and embedded control into one system", "Achieved robust navigation performance, with adaptive obstacle avoidance"]
    },
    {
      "id": 1,
      "title": "Educational Injection Molding Machine",
      "description": "Designed and delivered the heating chamber, plunger assembly, and mold clamping system for a classroom-scale injection molding machine. Combined analysis, prototyping, and machine shop collaboration to create a safe, adaptable teaching tool for undergraduate manufacturing courses.",
      "detailedDescription": "For my senior capstone project, I was responsible for designing and validating the heating chamber, plunger assembly, and mold clamping system of a small-scale injection molding machine intended for classroom demonstrations. The chamber was machined from a 2\"x4\"x12\" steel billet and designed to withstand forces from a 6\" pneumatic cylinder at operating conditions of 300 °C and 5 ksi injection pressure, capable of making complex parts with ABS. I performed hand calculations of thermal expansion and stress, validating the design with FEA to confirm a safety factor of two. A tolerance-critical plunger–bushing interface was developed to prevent leakage or binding, and the chamber was suspended on two 12\" steel rails to thermally isolate it from the frame.\nThe mold clamping system was designed to resist separating forces under full injection pressure while accommodating both 6\"x4\"x2\" and 3\"x4\"x2\" molds with varying sprue locations. To refine the design before machining, we built three full-scale cardboard prototypes to test geometry, ergonomics, and mold alignment. I worked directly with the university machine shop, providing GD&T engineering drawings and adapting features based on machining feedback. Once fabricated, I integrated cartridge heaters, thermocouples, and pneumatic actuation, then conducted validation tests that demonstrated chamber temperature stability within 0.5 °C, reliable sealing, and repeatable mold retention. The completed system was delivered with full documentation, training materials, and a live demonstration for faculty and students.",
      "technologies": ["SolidWorks CAD", "Thermal & Structural FEA", "GD&T Engineering Drawings", "CNC Machining", "Pneumatic Actuation", "Thermal Controls"],
      "status": "Completed",
      "images": [
        { "file": "main.jpg", "caption": "Injection Molding Machine in use" },
        { "file": "overview.jpg", "caption": "Machine with safety cover removed" },
        { "file": "sideview.jpg", "caption": "Sideview of machine" },
        { "file": "parts.jpg", "caption": "Examples parts showing capabilities and educational failures" },
        { "file": "pov.jpg", "caption": "First person view of operating the machine" },
        { "file": "heating-chamber-cad.jpg", "caption": "CAD of heating chamber with plunger" },
        { "file": "mold-clamp-cad.jpg", "caption": "CAD of mold clamp assembly" },
        { "file": "leak-test.jpg", "caption": "Tolerance pressure leak testing with 1 ton press" },
        { "file": "heating-test.jpg", "caption": "Preheating time test" },
        { "file": "clogging-test.jpg", "caption": "Pellet clogging test" }
      ],
      "folder": "injection-molding",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2025-04-30",
      "category": "Class Project",
      "challenges": ["Achieving tight tolerances for mechanical seals while accounting for thermal expansion", "Preventing mold separation and leakage under high-pressure injection", "Designing around classroom constraints (height, portability, visibility)", "Collaborating with machinists to align designs with manufacturing capabilities"],
      "outcomes": ["Delivered a fully functional injection molding teaching tool now used in classrooms", "Chamber and plunger assembly validated by analysis and full-scale testing", "Mold clamping system enabled safe, repeatable operation across multiple mold sizes","Produced complete documentation, including operation, maintenance, and troubleshooting guides","Demonstrated ability to lead a subsystem from concept through design, prototyping, machining, and validation"]
    },
    {
      "id": 3,
      "title": "String Art Printer",
      "description": "Designed and built a machine to automate string art image creation by wrapping a continuous thread around 200–400 pegs on a laser-cut acrylic frame. Served as both a functional prototype and a sandbox for learning CAD, motion control, and electronics integration.",
      "detailedDescription": "This long-term personal project began in 2020 with the goal of automating the creation of string art images that are traditionally done by hand. A manual proof-of-concept demonstrated feasibility but required over 12 hours to complete a single image. To automate the process, I designed and built a machine consisting of a stepper-driven turntable supporting a peg frame and a syringe-based threader that directs the string around selected pegs. A greedy optimization algorithm written in Python generates the image path, which is transmitted via serial communication to an Arduino Uno. The Arduino controls the motion system through stepper drivers, directing thousands of thread placements over multi-hour print cycles.\nThe original timing belt drive achieved only ~1° effective accuracy (vs. 0.09° theoretical), insufficient for the ~0.3° precision required for high-density patterns. To address backlash, I designed a 3D-printed cycloidal drive paired with a BLDC motor and magnetic encoder for PID-controlled positioning. The threader operates on open-loop stepper control with homing via a limit switch. Supporting torque, speed, and accuracy calculations validated feasibility, and the machine has successfully produced early geometric test patterns of ~50 lines.\nI completed all mechanical design, fabrication, wiring, and control integration, while collaborating on the image-generation software. Beyond its practical function, the project has been an ongoing sandbox for experimenting with CAD, FDM/SLA printing, Arduino programming, and motion control design.\n",
      "technologies": ["Arduino/C++","SolidWorks CAD","Stepper & BLDC Motors","Cycloidal Drive Design","Python Image Processing","3D Printing"],
      "status": "In Progress",
      "images": [
        { "file": "timingbelt.jpg", "caption": "String Art Printer with timing belt actuated turn table" },
        { "file": "functional.jpg", "caption": "String Art Printer in use" },
        { "file": "einstein-andrey-saharov.jpg", "caption": "Proffesional Example String Art (Andrey Saharov)" },
        { "file": "manual.jpg", "caption": "Manual sting art of skull" },
        { "file": "geometric-proof.jpg", "caption": "Geometric test print" },
        { "file": "cycloid.jpg", "caption": "Cycloidal drive based turntable" },
        { "file": "cad.jpg", "caption": "CAD of cycloidal drive" }
      ],
      "folder": "string-art",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": null,
      "category": "Personal Project",
      "challenges": ["Reducing backlash in the turntable from ~1° error toward the 0.3° precision", "Designing a low-backlash cycloidal drive as a replacement for the timing belt", "Synchronizing string placement across thousands of cycles without position loss"],
      "outcomes": ["Transitioned from a 12-hour manual proof-of-concept to automated printing of geometric string patterns", "Designed and prototyped a custom cycloidal drive to address backlash limitations.", "Gained substantial experience in CAD, Arduino programming, and precision motion systems through an exploratory, self-driven project"]
    },
      {
      "id": 4,
      "title": "Light Weight Pully Based Linear Actuator",
      "description": "Designed and built a lightweight linear actuator using carbon fiber tubes, Kevlar cords, and 3D-printed frames. Achieved smooth extension from 0.5 m to 0.9 m with a string-based pulley system, emphasizing force-to-weight efficiency and manufacturability.",
      "detailedDescription": "This personal project explores the use of string actuation to create compact, efficient linear actuators for robotic applications. The actuator frame consists of three 6 mm carbon fiber rods and a 27 mm piston tube, supported by custom one-piece 3D-printed PLA frames at the base, middle, and top. Two Kevlar cords (rated for 120 lbs) are routed through v-groove bearings in the frame, providing a 1:4 pulley ratio between the BLDC motor spools and piston travel. Unlike the first prototype, which used a capstan drive prone to slip, the second prototype employs dual spools—one for extension and one for retraction—eliminating cord slippage.\nThe middle section couples to the piston with a compliant taper fit and    is guided by POM U-groove bearings, while the top section stabilizes the piston with roller bearings. Hardware such as screws, pins, and precision bearings are directly integrated into the printed sections, enabling complex geometries to be produced as single, support-free prints. The actuator is designed to deliver a theoretical peak force of 25 N and no-load speed of 1 m/s, with mechanical hard stops preventing over-travel. Future iterations will integrate a pulley-mounted load cell to enable end-of-travel detection and closed-loop force control.\nWhile still at the proof-of-concept stage, the project demonstrates the feasibility of lightweight, manufacturable actuators with excellent force-to-weight ratios. Potential applications include robotic legs for quadrupeds or compact Stewart platforms.",
      "technologies": ["SolidWorks CAD", "FDM 3D Printing", "Carbon Fiber Tubes","Kevlar Cords","BLDC Motor Control","Pulley Systems"],
      "status": "In Progress",
      "images": [
        { "file": "main.jpg", "caption": "Inspiration Actuator (top) (Harrison Low on youtube), V1 prototype with embedded motor in base, CAD of V2 prototype, V2 prototype actuator (bottom)" },
        { "file": "v2-cad-bottom.jpg", "caption": "Base section of V2, motor and spool housing" },
        { "file": "v2-cad-mid.jpg", "caption": "Mid section of V2, piston mount, v-groove pully routing, POM bearing frame guides" },
        { "file": "v2-cad-top.jpg", "caption": "Top section of V2, POM bearing guides, cord routing through small carbon tube" }
      ],
      "folder": "linear-actuator",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": null,
      "category": "Personal Project",
      "challenges": ["Eliminating cord slip from the original capstan-driven prototype", "Designing complex one-piece printed frames with internal channels and features for easy assembly and low weight", "Balancing stiffness and strength while keeping mass under 600 g","Integrating bearings into printed parts without compromising manufacturability"],
      "outcomes": ["Built two functional prototypes, with Prototype 2 demonstrating smooth and reliable extension/retraction", "Refined actuator design achieving extension from 0.5 m to 0.9 m with ~600 g total mass", "Established a modular, manufacturable approach suitable for advanced robotic systems", "Positioned the design for future implementation of load sensing and closed-loop control"]
    },
      {
      "id": 7,
      "title": "Smart Parking Sensor System",
      "description": "Designed and built a smart parking assistance system using laser TOF sensors and RGB LED strips to guide cars into a tight carport. Achieved sub-inch accuracy and improved parking safety in a constrained environment.",
      "detailedDescription": "This personal project addressed a parking challenge in a carport where vehicles had to stop within two inches of a wall to clear a rear gate. I built a system using ten VL53L0X laser time-of-flight sensors (five per parking spot) mounted on the wall, paired with WS2812B addressable RGB LED strips for visual feedback. A single ESP32 read all sensors over a shared I²C bus and interpolated their outputs across the LED strip, giving smooth, color-based distance feedback regardless of vehicle size or alignment. As the car approached, the LEDs transitioned from blue to red, with the strip flashing when the vehicle was near.\nTo improve efficiency, the system entered sleep mode after 30 seconds of inactivity, shutting off the LED strips to reduce power draw, and reactivated automatically when motion was detected. Custom 3D-printed enclosures for the sensors, protected them from dust, and relieved wiring strain. Testing showed the system consistently provided distance readings accurate within 0.5 inches, making it easy to park precisely and safely in both spots.",
      "technologies": ["ESP32 Microcontroller", "Laser TOF Sensors", "RGB LED Strips", "Arduino/C++", "I²C Communication", "3D Printing"],
      "status": "Completed",
      "images": [
        { "file": "main.jpg", "caption": "Wall mounted parking sensor in 2 spot car port" },
        { "file": "pov.jpg", "caption": "View of parking sensor from car" },
        { "file": "testing.jpg", "caption": "ESP32 and 3 TOF sensors for proof of concept" },
        { "file": "sensor-box-cad.jpg", "caption": "3D printed enclosure for TOF sensor" }
      ],
      "folder": "parking-sensor",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2025-07-05",
      "category": "Personal Project",
      "challenges": ["Achieving accurate alignment of ten sensors for consistent multi-spot coverage", "Interpolating sensor data to provide smooth LED feedback across vehicle sizes", "Protecting electronics with custom enclosures while maintaining precision alignment"],
      "outcomes": ["Delivered a fully functional smart parking system supporting two parking spots", "Achieved sub-inch accuracy in guiding vehicles to stop within the tight carport clearance", "Improved daily usability by providing clear, intuitive feedback to drivers", "Demonstrated integration of sensor fusion, embedded control, and user-centered design in a real-world application"]
    },
      {
      "id": 8,
      "title": "Powder Size Analysis MATLAB App",
      "description": "Developed a custom MATLAB app for automatically identifying powder particles from microscope images and generating particle size distributions. Enabled rapid quality checks of Ti64 powder used in LPBF, reducing analysis time from hours to minutes.",
      "detailedDescription": "This project involved creating a standalone MATLAB application using App Designer to streamline particle size analysis in additive manufacturing research. I programmed the UI and underlying image-processing functions, integrating thresholding, noise reduction, and a Hough transform for automated circle detection. The app detects powder particles from both SEM and optical images, generates particle size histograms, and exports results to Excel. A key focus was usability—building a simple, intuitive interface so that non-programmers in the lab could reliably process images.\nThe app allowed our team to analyze 10+ images in the time it previously took to manually measure one using ImageJ, enabling much faster turnaround for powder quality checks. It was applied in a pending publication examining how particle size distributions in Ti64 powders evolve after multiple LPBF builds and was also used internally for routine powder quality verification.",
      "technologies": ["MATLAB App Designer", "MATLAB Image Processing Toolbox", "Hough Transform","SEM/Optical Microscopy","Data Visualization"],
      "status": "Completed",
      "images": [
        { "file": "main.jpg", "caption": "Powder Analysis App in use" }
      ],
      "folder": "powder-app",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2025-05-19",
      "category": "Research Lab Project",
      "challenges": ["Translating image processing steps (thresholding, filtering, circle detection) into a user-friendly UI", "Ensuring robust particle detection across varying image types (SEM vs optical)", "Achieving reliable results without requiring much manual tuning for each dataset"],
      "outcomes": ["Reduced powder particle analysis time from ~1 hour to under 3 minutes per image", "Delivered an easy-to-use application adopted by lab peers for both research and quality control", "Contributed to a pending research publication on LPBF Ti64 powder degradation"]
    },
      {
      "id": 9,
      "title": "Stress-Strain Analysis MATLAB App",
      "description": "Created a MATLAB app to automate analysis of stress-strain data from a universal testing machine. Reduced processing time from 3 hours to 20 minutes for 20 datasets, improving repeatability and enabling adoption across multiple research projects.",
      "detailedDescription": "This project involved developing a MATLAB application using App Designer to automate the extraction of mechanical properties from tensile and compression tests. The app imports raw stress–strain data from the universal testing machine, plots the curves, and applies a moving-window linear regression to compute local gradients and curvature. This method enables accurate identification of the linear elastic region even in noisy datasets, from which the elastic modulus is calculated. The program then applies the 0.2% strain offset method to determine yield strength, with all results exported directly to Excel for reporting and comparison.\nThe app was designed with an intuitive interface to allow quick parameter tuning and visual review of plots, making it usable by lab members without programming experience. With this tool, 20 datasets could be processed in under 20 minutes compared to ~3 hours using manual Excel workflows. It is now in active use across multiple projects in the lab, improving both turnaround and consistency in mechanical property reporting.",
      "technologies": ["MATLAB App Designer", "Stress-Strain Analysis", "Linear Regression","Data Visualization"],
      "status": "Completed",
      "images": [
        { "file": "main.jpg", "caption": "Stress-Strain Analysis App in use" }
      ],
      "folder": "compression-app",
      "link": "#",
      "github": "#",
      "featured": true,
      "completedDate": "2025-05-03",
      "category": "Research Lab Project",
      "challenges": ["Handling noisy stress-strain data by applying moving-window regression and curvature analysis", "Designing a clean and intuitive UI", "Ensuring results were consistent and reusable across different test conditions and materials"],
      "outcomes": ["Reduced dataset analysis time by ~5x (3 hours to 20 minutes for 20 datasets)", "Provided consistent reporting of modulus and yield strength across projects", "Exported values and plots directly to Excel, streamlining data management", "Adopted by lab peers for ongoing mechanical testing and materials research"]
    }
  ],
  "categories": [
    "Class Project",
    "Personal Project",
    "Research Lab Project"
  ],
  "statuses": [
    "Planning",
    "Design Phase",
    "In Progress",
    "Testing",
    "Completed",
    "Published"
  ]
}